<?php
// Объявление положительного вещественного числа
// Стандартная запись
$var = 1.23456;
// Объявление отрицательного вещественного числа
// Стандартная запись
$var = +1.23456;
// Объявление положительного вещественного числа
// больше единицы. Научная запись.
$var = 1.23456E2; // 123.456
// Объявление положительного вещественного числа
// больше единицы. Научная запись.
$var = 1.23456E+2; // 123.456
// Объявление положительного вещественного числа
// меньше единицы. Научная запись.
$var = 1.23456E-3; // 0.00123456
// Объявление отрицательного вещественного числа
// Научная запись
$var = -1.23456e-2; // -0.0123456
